answer_one = input("""Вот твой первый вопрос:
      Кто был первым призидентом России?
      1. Путин Владимир Владимирович
      2. Ельцин Еорис Николаевич
      3. Медведев Дмитрий Анатольевич
      4. Мишустин Михаил Владимирович""")
if answer_one == "2":
   
    answer_two = input("""Вот твой второй вопрос:
    Кто основатель компании Minecrasoft?
    1. Уильям (Билл) Гейтс
    2. Стив Джобс
    3. Илон Маск
    4. Марк Цукерберг""")
    if answer_two == "1":
        
        answer_three = input("""Вот твой третий вопрос:
    Какая буква завершает греческий алфавит?
    1. Ипсилон
    2. Йота
    3. Пси
    4. Омега""")
        if answer_three == "4":
           
            answer_four = input("""Вот твой четвёртый вопрос:
    В “Hellsing,” какое имя использует Алукард в своей человеческой форме?
    1. Александр Андерсон
    2. Уолтер С. Дорнез
    3. Арукард Влад Тепеш
    4. Люк Валентайн""")
            if answer_four == "3":
               
                answer_five = input("""Вот твой пятый вопрос:
     Какой фирменный способ передвижения у магического существа Тоторо в “My Neighbor Totoro”?
    1. Мотоцикл
    2. Котобус
    3. метла
    4. Летающая тарелка""")
                if answer_five == "2":
                   
                    answer_six = input("""Вот твой шестой вопрос:
    Как называется первый меч Кирито в игре “Sword Art Online”?
    1. Темный Отпор
    2. Лучезарный Свет
    3. Экскалибур
    4. Элюсидатор""")
                    if answer_six == "4":
                       
                        answer_seven = input("""Вот твой седьмой вопрос:
    Кто является очаровательным существом, любящим яблоки, в “Death Note”?
    1. Рюк
    2. Рем
    3. Мелло
    4. Сидо""")
                        if answer_seven == "1":
                            
                            answer_eight = input("""Вот твой восьмой вопрос:
    В Fullmetal Alchemist: Brotherhood, что означает титул Эдварда “Стальной алхимик”?
    1. У него механическая рука и нога
    2. Он может манипулировать металлом с помощью алхимии
    3. Он искусен в создании оружия с помощью алхимии
    4. Всё выше перечисленное""")
                            if answer_eight == "4":
                               
                                answer_nine = input("""Вот твой девятый вопрос:
    В Какое явление превращает всё человечество в камень в аниме “Dr. Stone”?
    1. Солнечная Вспышка
    2. Луч Петрификации
    3. Комета
    4. Вирус""")
                                if answer_nine == "2":          
                                    answer_ten = input("""Вот твой десятый вопрос:
    Как зовут демона, который обладает мечом Инуяши в “Inuyasha”?
    1. Сэссёмару
    2. Кикё
    3. Нараку
    4. Кагура""")
                                    if answer_ten == "3":
                                        print("Вы победили, выигрыш составил 1кк")
                                    else:
                                        print("Вы проиграли, Ваш выигрыш составил 700к")
                                else:
                                    print("Вы проиграли, Ваш выигрыш составил 700к")
                            else:
                                print("Вы проиграли, Ваш выигрыш составил 700к")
                        else:
                            print("noВы проиграли, Ваш выигрыш составил 300к")
                    else:
                        print("Вы проиграли, Ваш выигрыш составил 300к")
                else:
                    print("Вы проиграли, Ваш выигрыш составил 300к")
            else:
                print("Вы проиграли, Ваш выигрыш составил 300к")
        else:
            print("Вы проиграли и ничего не выйграли")
    else:
        print("Вы проиграли и ничего не выйграли")
else:
    print("Вы проиграли и ничего не выйграли")










